tap "epk/epk"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "b2sum"
brew "libssh2"
brew "bat"
brew "python@3.12"
brew "glib"
brew "qemu"
brew "lima"
brew "colima"
brew "colordiff"
brew "rtmpdump"
brew "curl"
brew "freetds"
brew "libavif"
brew "php"
brew "composer"
brew "docker"
brew "docker-credential-helper"
brew "fish"
brew "fzf"
brew "git"
brew "gnupg"
brew "lazydocker"
brew "lazygit"
brew "loc"
brew "lsd"
brew "neovim"
brew "openssl@1.1"
brew "pgloader"
brew "podman"
brew "pyenv"
brew "redis"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "volta"
brew "zellij"
brew "zoxide"
brew "felixkratz/formulae/borders"
cask "aerospace"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "amethyst"
cask "betterdisplay"
cask "dbngin"
cask "discord"
cask "dropzone"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font"
cask "iterm2"
cask "karabiner-elements"
cask "ngrok"
cask "numi"
cask "obsidian"
cask "podman-desktop"
cask "raycast"
cask "telegram"
cask "tidal"
cask "utm"
cask "wezterm"
cask "whatsapp"
vscode "albert.tabout"
vscode "bmewburn.vscode-intelephense-client"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "cssho.vscode-svgviewer"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "estevamsouza.the-best-themes-for-programmers"
vscode "fabiospampinato.vscode-diff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "jock.svg"
vscode "juanblanco.solidity"
vscode "liamhammett.inline-parameters"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "pranjalkumar.minimal-kiwi"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "sdras.night-owl"
vscode "statelyai.stately-vscode"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "tomrijndorp.find-it-faster"
vscode "unifiedjs.vscode-mdx"
vscode "vercel.turbo-vsc"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wix.glean"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
